ЕСКД/src/Documents/mega_ПланПроизводства/mega_ПланПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>mega_ПланПроизводства</name>
  <registerRecords>AccumulationRegister.mega_ПроизводственныеРесурсы</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.mega_Спецификации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЕСКД/src/AccumulationRegisters/mega_ПроизводственныеРесурсы/mega_ПроизводственныеРесурсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>mega_ПроизводственныеРесурсы</name>
  <resources>
    <name>Время</name>
    <type>
      <types>DefinedType.mega_ВремяВСекундах</types>
    </type>
  </resources>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.mega_Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСтадииОбработки</name>
    <type>
      <types>CatalogRef.mega_ВидыСтадийОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехнологическаяОперация</name>
    <type>
      <types>CatalogRef.mega_Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.mega_ПроизводственныеРесурсы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРесурса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЕСКД/src/Catalogs/mega_Спецификации/mega_Спецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>mega_Спецификации</name>
  <basedOn>Catalog.mega_ШаблоныСпецификаций</basedOn>
  <owners>Catalog.mega_Номенклатура</owners>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтадииОбработки</name>
    <attributes>
      <name>ВидСтадииОбработки</name>
      <type>
        <types>CatalogRef.mega_ВидыСтадийОбработки</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Спецификация</name>
      <type>
        <types>CatalogRef.mega_Спецификации</types>
      </type>
    </attributes>
    <attributes>
      <name>СтадияОбработки</name>
      <type>
        <types>CatalogRef.mega_ВидыСтадийОбработки</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическиеОперации</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.mega_КоличественнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.mega_ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>DefinedType.mega_ВремяВСекундах</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЕСКД/src/Catalogs/mega_ПроизводственныеРесурсы/mega_ПроизводственныеРесурсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>mega_ПроизводственныеРесурсы</name>
  <attributes>
    <name>Время</name>
    <type>
      <types>DefinedType.mega_ВремяВСекундах</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>DefinedType.mega_ВремяВСекундах</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЕСКД/src/Documents/mega_ПланПроизводства/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Перем ТаблицаОстатковПроизводственныхРесурсов;
Перем ДатаНачалаПланирования;

#Область ПрограммныйИнтерфейс


#Область ДляВызоваИзДругихПодсистем

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
    	
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ИнициализироватьТаблицуОстатковПроизводственныхРесурсов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроизводственныеРесурсы.Ресурс КАК Ресурс,
	|	ПроизводственныеРесурсы.ДатаРесурса КАК ДатаРесурса,
	|	ПроизводственныеРесурсы.ВремяОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.mega_ПроизводственныеРесурсы.Остатки(, ДатаРесурса >= &ДатаНачалаПланирования) КАК ПроизводственныеРесурсы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ресурс,
	|	ДатаРесурса";
	
	Запрос.УстановитьПараметр("ДатаНачалаПланирования", ДатаНачалаПланирования);
	
	Результат = Запрос.Выполнить();
	ТаблицаОстатковПроизводственныхРесурсов = Результат.Выгрузить();
	ТаблицаОстатковПроизводственныхРесурсов.Индексы.Добавить("Ресурс");
	ТаблицаОстатковПроизводственныхРесурсов.Индексы.Добавить("ДатаРесурса");	
КонецПроцедуры

Функция ПолучитьОперацииСпецификации(Спецификация, Количество = 1)Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ                                             
	|	СтадииОбработки.НомерСтроки КАК НомерСтроки,
	|	СтадииОбработки.ВидСтадииОбработки КАК ВидСтадииОбработки,
	|	СтадииОбработки.Количество КАК НормаПроизводства,	
	|	ТехнологическиеОперации.Номенклатура КАК ТехнологическаяОперация,
	|	ТехнологическиеОперации.Номенклатура.ПроизводственныйРесурс КАК ПроизводственныйРесурс,	
	|	ТехнологическиеОперации.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	&Количество КАК Количество,
	|	ТехнологическиеОперации.ВремяВыполнения / ТехнологическиеОперации.Ссылка.Количество КАК ВремяВыполненияЕдиницы,
	|	ТехнологическиеОперации.ВремяВыполнения / ТехнологическиеОперации.Ссылка.Количество * &Количество КАК ВремяВыполнения,
	|	СтадииОбработки.Ссылка КАК Спецификация
	|ИЗ
	|	Справочник.mega_Спецификации.ТехнологическиеОперации КАК ТехнологическиеОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.mega_Спецификации.СтадииОбработки КАК СтадииОбработки
	|		ПО ТехнологическиеОперации.Ссылка = СтадииОбработки.Ссылка
	|			И ТехнологическиеОперации.КлючСвязи = СтадииОбработки.КлючСвязи
	|ГДЕ
	|	ТехнологическиеОперации.Ссылка = &Спецификация
	|	И ТехнологическиеОперации.Номенклатура.ПроизводственныйРесурс <> ЗНАЧЕНИЕ(Справочник.mega_ПроизводственныеРесурсы.ПустаяСсылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
		
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.УстановитьПараметр("Количество", Количество);
	РезультатЗапроса = Запрос.Выполнить();
				
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

Функция ПолучитьОстаткиПроизводственногоРесурса(ПроизводственныйРесурс)
	ТаблицаОстатковПроизводственныхРесурсов.НайтиСтроки(Новый Структура(""));
КонецФункции

Процедура СоздатьПроводки(ОперацииСпецификации)
	
	Для Каждого Выборка Из ОперацииСпецификации Цикл 
		
		Время = Выборка.ВремяВыполненияЕдиницы * Выборка.НормаПроизводства;
		
		Пока Время <> 0 Цикл
		КонецЦикла;	
		Движение = Движения.mega_ПроизводственныеРесурсы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ДатаРесурса = ДатаНачалаПланирования;
		Движение.Ресурс = Выборка.ПроизводственныйРесурс;			
		Движение.Время = Время;		
		Движение.Спецификация = Выборка.Спецификация;
		Движение.ВидСтадииОбработки = Выборка.ВидСтадииОбработки;
		Движение.ТехнологическаяОперация = Выборка.ТехнологическаяОперация;
		
		Выборка.ВремяВыполнения = Выборка.ВремяВыполнения - Время;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
			
	Движения.mega_ПроизводственныеРесурсы.Записывать = Истина;
	ОсвободитьРанееЗанятыеРесурсы();
	
	ДатаНачалаПланирования = НачалоДня(ТекущаяДатаСеанса());
	ИнициализироватьТаблицуОстатковПроизводственныхРесурсов();
	
	Для Каждого ТекСтрокаСостав Из Состав Цикл 
		
		ОперацииСпецификации = ПолучитьОперацииСпецификации(ТекСтрокаСостав.Спецификация, ТекСтрокаСостав.Количество);		
		ВремяВыполнения = ОперацииСпецификации.Итог("ВремяВыполнения");
		
		Пока ВремяВыполнения <> 0 Цикл 
			
			СоздатьПроводки(ОперацииСпецификации);
			ВремяВыполнения = ОперацииСпецификации.Итог("ВремяВыполнения");
		КонецЦикла;				
	КонецЦикла;
КонецПроцедуры

Процедура ОсвободитьРанееЗанятыеРесурсы()            
	
	Движения.mega_ПроизводственныеРесурсы.Очистить();
	Движения.mega_ПроизводственныеРесурсы.Записать();	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
		
	Ответственный    = Пользователи.ТекущийПользователь();
	Автор            = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
